In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [4]:
obj=pd.Series([4,6,3,2])

In [5]:
obj

0    4
1    6
2    3
3    2
dtype: int64

In [7]:
obj.values

array([4, 6, 3, 2], dtype=int64)

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2=pd.Series([4,6,3,2],index=['d','c','s','z'])

In [11]:
obj2

d    4
c    6
s    3
z    2
dtype: int64

In [12]:
obj2['d']

4

In [14]:
obj2[obj2>3]

d    4
c    6
dtype: int64

In [16]:
obj2*2

d     8
c    12
s     6
z     4
dtype: int64

In [17]:
import numpy as np
np.exp(obj2)

d     54.598150
c    403.428793
s     20.085537
z      7.389056
dtype: float64

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = pd.Series(sdata)

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = pd.Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [29]:
obj4.index.name = 'state'

In [30]:
obj4.name = 'population'

In [31]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    6
Jeff     3
Ryan     2
dtype: int64

In [2]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [3]:
frame=pd.DataFrame(data)

In [4]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [5]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [6]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [7]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
    index=['one', 'two', 'three', 'four',
    'five', 'six'])

In [8]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [9]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [10]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [11]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [12]:
frame2['debt']=16.5

In [13]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [16]:
import numpy as np
frame2['debt']=np.arange(6.0)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [17]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [18]:
frame2['debt']=val

In [19]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [20]:
frame2['eastern']=frame2['state']=='Ohio'

In [21]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [23]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [24]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [25]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [27]:
pd.DataFrame(frame3, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [29]:
pdata = {'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Nevada'][:-1]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [30]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [31]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [32]:
labels = pd.Index(np.arange(3))
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [34]:
obj2.index is labels

True

In [35]:
'Ohio' in frame3.columns

True

In [37]:
2002 in frame3.index

True

In [38]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [39]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [40]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [41]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
    index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [42]:
frame2=frame.reindex(['a','b','c','d'])

In [43]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [44]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [47]:
frame.loc[['a', 'b', 'c', 'd'], states]

D:\anzhuanggongju\Anaconda3-5.2.0\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [48]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [50]:
obj.index.is_unique

False

In [51]:
obj['a']

a    0
a    1
dtype: int64

In [52]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  1.558221  0.041349 -0.328810
a  0.163463 -0.299989 -0.645837
b  0.055755 -1.916854  0.673603
b  0.529646 -2.407426  1.647664

In [53]:
df.loc['b']

          0         1         2
b  0.055755 -1.916854  0.673603
b  0.529646 -2.407426  1.647664

In [54]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]],
    index=['a', 'b', 'c', 'd'],
    columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [55]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [58]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [59]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [60]:
df.idxmax()

one    b
two    d
dtype: object

In [61]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [62]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [64]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [66]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [67]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [69]:
 pd.value_counts(obj.values, sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [70]:
obj.values

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [71]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [72]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [74]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [75]:
result = data.apply(pd.value_counts).fillna(0)

In [76]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [79]:
df=pd.read_csv('ex1.csv')
df

    a   b   c  d  mes
0   1   2   3  4   he
1   5   6   7  8  wor
2  12  11  10  9  foo

In [80]:
pd.read_csv('ex1.csv',header=None)

    0   1   2  3    4
0   a   b   c  d  mes
1   1   2   3  4   he
2   5   6   7  8  wor
3  12  11  10  9  foo

In [81]:
pd.read_csv('ex1.csv',index_col='mes')

      a   b   c  d
mes
he    1   2   3  4
wor   5   6   7  8
foo  12  11  10  9

In [82]:
list(open('ex1.csv'))

['a,b,c,d,mes\n', '1,2,3,4,he\n', '5,6,7,8,wor\n', '12,11,10,9,foo\n']

In [83]:
pd.read_csv('ex1.csv',skiprows=[0])

    1   2   3  4   he
0   5   6   7  8  wor
1  12  11  10  9  foo

In [84]:
pd.isnull(df)

       a      b      c      d    mes
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False

In [86]:
pd.read_csv('ex1.csv',na_values=['NULL'])

    a   b   c  d  mes
0   1   2   3  4   he
1   5   6   7  8  wor
2  12  11  10  9  foo

In [87]:
pd.read_csv('ex1.csv',na_values={'mes':['wor']})

    a   b   c  d  mes
0   1   2   3  4   he
1   5   6   7  8  NaN
2  12  11  10  9  foo

In [88]:
pd.read_csv('ex1.csv',na_values=['wor'])

    a   b   c  d  mes
0   1   2   3  4   he
1   5   6   7  8  NaN
2  12  11  10  9  foo

In [89]:
pd.options.display.max_rows = 10

In [90]:
pd.read_csv('ex1.csv',nrows=1)

   a  b  c  d mes
0  1  2  3  4  he

In [91]:
chunker=pd.read_csv('ex1.csv',chunksize=14)

In [94]:
df.to_csv('ex2.csv')

In [95]:
import sys
df.to_csv(sys.stdout,sep='|')

|a|b|c|d|mes
0|1|2|3|4|he
1|5|6|7|8|wor
2|12|11|10|9|foo

In [96]:
df.to_csv(sys.stdout,na_rep='NULL')

,a,b,c,d,mes
0,1,2,3,4,he
1,5,6,7,8,wor
2,12,11,10,9,foo

In [97]:
df.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3
5,6,7
12,11,10

In [98]:
df.to_csv(sys.stdout,index=False,header=False)

1,2,3,4,he
5,6,7,8,wor
12,11,10,9,foo

In [99]:
dates = pd.date_range('1/1/2000', periods=7)

In [101]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [102]:
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [103]:
import csv
f = open('ex2.csv')

In [104]:
reader=csv.reader(f)

In [106]:
for line in reader:
    print(line)

['', 'a', 'b', 'c', 'd', 'mes']
['0', '1', '2', '3', '4', 'he']
['1', '5', '6', '7', '8', 'wor']
['2', '12', '11', '10', '9', 'foo']

In [108]:
with open('ex2.csv') as f:
    lines=list(csv.reader(f))

In [109]:
header, values = lines[0], lines[1:]

In [110]:
header

['', 'a', 'b', 'c', 'd', 'mes']

In [111]:
values

[['0', '1', '2', '3', '4', 'he'],
 ['1', '5', '6', '7', '8', 'wor'],
 ['2', '12', '11', '10', '9', 'foo']]

In [112]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [113]:
data_dict

{'': ('0', '1', '2'),
 'a': ('1', '5', '12'),
 'b': ('2', '6', '11'),
 'c': ('3', '7', '10'),
 'd': ('4', '8', '9'),
 'mes': ('he', 'wor', 'foo')}

In [115]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [116]:
import json

In [117]:
result = json.loads(obj)

In [118]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [119]:
obj

'\n{"name": "Wes",\n"places_lived": ["United States", "Spain", "Germany"],\n"pet": null,\n"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n{"name": "Katie", "age": 38,\n"pets": ["Sixes", "Stache", "Cisco"]}]\n}\n'

In [120]:
asjson = json.dumps(result)

In [121]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [122]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [123]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [126]:
df.to_pickle('frame_pickle')

In [129]:
pd.read_pickle('frame_pickle')

    a   b   c  d  mes
0   1   2   3  4   he
1   5   6   7  8  wor
2  12  11  10  9  foo

In [130]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [131]:
frame

           a
0   2.568624
1  -1.597808
2  -0.455324
3  -0.551995
4  -0.196762
..       ...
95  0.472551
96  0.691344
97 -0.065312
98  0.353287
99  1.082948

[100 rows x 1 columns]

In [182]:
store = pd.HDFStore('mydata.h5')

In [133]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [134]:
store['obj1'] = frame

In [135]:
store['obj1_col'] = frame['a']

In [138]:
store['obj1']

           a
0   2.568624
1  -1.597808
2  -0.455324
3  -0.551995
4  -0.196762
..       ...
95  0.472551
96  0.691344
97 -0.065312
98  0.353287
99  1.082948

[100 rows x 1 columns]

In [139]:
store.put('obj2', frame, format='table')

In [140]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -1.808120
11 -0.069819
12  0.398284
13 -0.590090
14 -0.941511
15 -0.108415

In [141]:
store.close()

In [142]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [143]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  2.568624
1 -1.597808
2 -0.455324
3 -0.551995
4 -0.196762

In [145]:
xlsx = pd.ExcelFile('ex1.xlsx')

In [146]:
pd.read_excel(xlsx, 'Sheet1')

    a   b   c  d  mes
0   1   2   3  4   he
1   5   6   7  8  wor
2  12  11  10  9  foo

In [147]:
frame = pd.read_excel('ex1.xlsx', 'Sheet1')

In [148]:
frame

    a   b   c  d  mes
0   1   2   3  4   he
1   5   6   7  8  wor
2  12  11  10  9  foo

In [152]:
writer = pd.ExcelWriter('ex2.xlsx')

In [153]:
frame.to_excel(writer, 'Sheet1')

In [154]:
writer.save()

In [155]:
frame.to_excel('ex2.xlsx')

In [156]:
import requests

In [157]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [158]:
resp = requests.get(url)

In [159]:
resp

In [160]:
data=resp.json()

In [161]:
data[0]['title']

'SparseArrays backed by other Extension array/dtype ?'

In [163]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                  'labels', 'state'])

In [164]:
issues

,number,title,labels,state
0,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
1,26406,BUG: to_numpy on categorical data with tz awar...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
3,26404,Fix type annotations in pandas.core.indexes.da...,[],open
4,26403,DEPR: Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
...,...,...,...,...
25,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
27,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
29,26372,Misc Type Annotation fixes,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open

In [165]:
pd.DataFrame(data)

,assignee,assignees,author_association,body,closed_at,comments,comments_url,created_at,events_url,html_url,...,milestone,node_id,number,pull_request,repository_url,state,title,updated_at,url,user
0,None,[],MEMBER,You can create an SparseDtype with a Extension...,None,0,https://api.github.com/repos/pandas-dev/pandas...,2019-05-15T09:29:00Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/26407,...,None,MDU6SXNzdWU0NDQzMzE0MzI=,26407,NaN,https://api.github.com/repos/pandas-dev/pandas,open,SparseArrays backed by other Extension array/d...,2019-05-15T09:29:10Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'jorisvandenbossche', 'id': 1020496,..."
1,None,[],MEMBER,```\r\nIn [1]: s = pd.Series(pd.Categorical(pd...,None,0,https://api.github.com/repos/pandas-dev/pandas...,2019-05-15T08:21:12Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/26406,...,None,MDU6SXNzdWU0NDQzMDAzODA=,26406,NaN,https://api.github.com/repos/pandas-dev/pandas,open,BUG: to_numpy on categorical data with tz awar...,2019-05-15T08:21:12Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'jorisvandenbossche', 'id': 1020496,..."
2,None,[],MEMBER,xref https://github.com/pandas-dev/pandas/issu...,None,5,https://api.github.com/repos/pandas-dev/pandas...,2019-05-15T06:55:56Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/26405,...,{'url': 'https://api.github.com/repos/pandas-d...,MDExOlB1bGxSZXF1ZXN0Mjc4OTYwOTI0,26405,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas,open,DEPR: deprecate Series/DataFrame.compound,2019-05-15T08:04:33Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'jorisvandenbossche', 'id': 1020496,..."
3,None,[],CONTRIBUTOR,- [x] closes #26366 \r\n- [ ] tests passed\r\n...,None,3,https://api.github.com/repos/pandas-dev/pandas...,2019-05-15T06:53:47Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/26404,...,None,MDExOlB1bGxSZXF1ZXN0Mjc4OTYwMzg5,26404,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas,open,Fix type annotations in pandas.core.indexes.da...,2019-05-15T07:56:29Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'vaibhavhrt', 'id': 22582828, 'node_..."
4,None,[],MEMBER,- [X] closes #26336\r\n- [X] tests added / pas...,None,2,https://api.github.com/repos/pandas-dev/pandas...,2019-05-15T06:27:48Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/26403,...,{'url': 'https://api.github.com/repos/pandas-d...,MDExOlB1bGxSZXF1ZXN0Mjc4OTUzODU5,26403,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas,open,DEPR: Deprecate ordered=None for CategoricalDtype,2019-05-15T07:29:19Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'jschendel', 'id': 5332445, 'node_id..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25,None,[],MEMBER,- [x] closes #26283\r\n- [x] tests added / pas...,None,2,https://api.github.com/repos/pandas-dev/pandas...,2019-05-14T00:06:47Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/26379,...,{'url': 'https://api.github.com/repos/pandas-d...,MDExOlB1bGxSZXF1ZXN0Mjc4NDc2NzQ2,26379,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas,open,BUG: Series.combine_first with mixed timezones,2019-05-14T23:26:56Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'mroeschke', 'id': 10647082, 'node_i..."
26,None,[],CONTRIBUTOR,Part of #25882\r\n- [X] tests passed\r\n- [X] ...,None,8,https://api.github.com/repos/pandas-dev/pandas...,2019-05-13T20:12:58Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/26377,...,None,MDExOlB1bGxSZXF1ZXN0Mjc4NDE3NTg2,26377,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas,open,Fix type annotations in pandas.core.ops,2019-05-15T00:53:08Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'gwrome', 'id': 1430066, 'node_id': ..."
27,None,[],NONE,"#### Code Sample, a copy-pastable example if p...",None,2,https://api.github.com/repos/pandas-dev/pandas...,2019-05-13T18:23:18Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/26376,...,{'url': 'https://api.github.com/repos/pandas-d...,MDU6SXNzdWU0NDM1Mzc4MTc=,26376,NaN,https://api.github.com/repos/pandas-dev/pandas,open,pd.read_fwf fails with file pointer to url,2019-05-14T10:59:37Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'leohaim', 'id': 7847768, 'node_id':..."
28,None,[],NONE,- [x] closes #26326 \r\n- [x] tests added / pa...,None,5,https://api.github.com/repos/pandas-dev/pandas...,2019-05-13T16:54:35Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/26374,...,None,MDExOlB1bGxSZXF1ZXN0Mjc4MzU2NDE3,26374,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas,open,BUG: ngroups and len(groups) do not equal when...,2019-05-14T18:12:55Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'shantanu-gontia', 'id': 4872525, 'n..."
29,None,[],CONTRIBUTOR,Part of #25882 \r\n- [X] passes `git diff upst...,None,4,https://api.github.com/repos/pandas-dev/pandas...,2019-05-13T15:20:49Z,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/26372,...,{'url': 'https://api.github.com/repos/pandas-d...,MDExOlB1bGxSZXF1ZXN0Mjc4MzIyMjI5,26372,{'url': 'https://api.github.com/repos/pandas-d...,https://api.github.com/repos/pandas-dev/pandas,open,Misc Type Annotation fixes,2019-05-14T03:11:12Z,https://api.github.com/repos/pandas-dev/pandas...,"{'login': 'gwrome', 'id': 1430066, 'node_id': ..."

In [166]:
import sqlite3

In [168]:
query="""
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [169]:
con = sqlite3.connect('mydata.sqlite')

In [170]:
con.execute(query)

In [171]:
con.commit()

In [172]:
data = [('Atlanta', 'Georgia', 1.25, 6),
    ('Tallahassee', 'Florida', 2.6, 3),
    ('Sacramento', 'California', 1.7, 5)]

In [173]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [174]:
con.executemany(stmt, data)

In [175]:
con.commit()

In [176]:
cursor = con.execute('select * from test')

In [177]:
rows = cursor.fetchall()

In [178]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [179]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [180]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [181]:
import sqlalchemy as sqla